apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_dma.c
/****************************************************************************
 * arch/risc-v/src/gd32vw55x/gd32vw55x_dma.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include <debug.h>
#include <errno.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/semaphore.h>

#include "riscv_internal.h"
#include "chip.h"
#include "hardware/gd32vw55x_rcu.h"
#include "gd32vw55x_dma.h"

#ifdef CONFIG_GD32VW55X_DMA

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* The GD32VW55x has a single DMA controller with 8 channels and each
 * channel can be connected to one of 8 sub-peripheral requests.
 */

#define DMA_NCHANNELS      GD32VW55X_NDMA_CHANNELS
#define DMA_NPERIPHS       GD32VW55X_NDMA_SUBPERIPHS

/* The interrupt flags of the channels 0-3 are held in the INTF0/INTC0
 * registers and the interrupt flags of the channels 4-7 in the INTF1/INTC1
 * registers.
 */

#define DMA_INTF_NCHANNELS (4)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure describes one DMA channel */

struct gd32_dma_channel_s
{
  uint8_t        chan_num;  /* DMA channel number (0-7) */
  uint8_t        irq;       /* DMA channel IRQ number */
  uint8_t        periph;    /* DMA sub-peripheral number (0-7) */
  sem_t          chsem;     /* Used to wait for the channel to be free */
  dma_callback_t callback;  /* Callback invoked when the DMA completes */
  void          *arg;       /* Argument passed to the callback function */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static uint8_t gd32_dma_interrupt_flag_get(uint8_t channelx);
static void gd32_dma_interrupt_flag_clear(uint8_t channelx, uint8_t flag);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* This array describes the state of each DMA channel */

static struct gd32_dma_channel_s g_dmachan[DMA_NCHANNELS] =
{
  {
    .chan_num = GD32_DMA_CH0,
    .irq      = GD32VW55X_IRQ_DMA_CH0,
    .chsem    = SEM_INITIALIZER(1),
  },
  {
    .chan_num = GD32_DMA_CH1,
    .irq      = GD32VW55X_IRQ_DMA_CH1,
    .chsem    = SEM_INITIALIZER(1),
  },
  {
    .chan_num = GD32_DMA_CH2,
    .irq      = GD32VW55X_IRQ_DMA_CH2,
    .chsem    = SEM_INITIALIZER(1),
  },
  {
    .chan_num = GD32_DMA_CH3,
    .irq      = GD32VW55X_IRQ_DMA_CH3,
    .chsem    = SEM_INITIALIZER(1),
  },
  {
    .chan_num = GD32_DMA_CH4,
    .irq      = GD32VW55X_IRQ_DMA_CH4,
    .chsem    = SEM_INITIALIZER(1),
  },
  {
    .chan_num = GD32_DMA_CH5,
    .irq      = GD32VW55X_IRQ_DMA_CH5,
    .chsem    = SEM_INITIALIZER(1),
  },
  {
    .chan_num = GD32_DMA_CH6,
    .irq      = GD32VW55X_IRQ_DMA_CH6,
    .chsem    = SEM_INITIALIZER(1),
  },
  {
    .chan_num = GD32_DMA_CH7,
    .irq      = GD32VW55X_IRQ_DMA_CH7,
    .chsem    = SEM_INITIALIZER(1),
  },
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: gd32_dma_clock_enable
 *
 * Description:
 *   Enable the DMA clock
 *
 ****************************************************************************/

static void gd32_dma_clock_enable(void)
{
  modifyreg32(GD32VW55X_RCU_AHB1EN, 0, RCU_AHB1EN_DMAEN);
}

/****************************************************************************
 * Name: gd32_dma_width_get
 *
 * Description:
 *   Convert a DMA_WIDTH_*_SELECT selection into the register encoded
 *   transfer width value.  32-bit is selected if the width selection is
 *   not valid.
 *
 ****************************************************************************/

static uint32_t gd32_dma_width_get(uint8_t width_select)
{
  uint32_t width;

  switch (width_select)
    {
      case DMA_WIDTH_8BITS_SELECT:
        width = 0;
        break;

      case DMA_WIDTH_16BITS_SELECT:
        width = 1;
        break;

      default:
      case DMA_WIDTH_32BITS_SELECT:
        width = 2;
        break;
    }

  return width;
}

/****************************************************************************
 * Name: gd32_dma_priority_get
 *
 * Description:
 *   Convert a DMA_PRIO_*_SELECT selection into the register encoded channel
 *   priority value.  The medium priority is selected if the priority
 *   selection is not valid.
 *
 ****************************************************************************/

static uint32_t gd32_dma_priority_get(uint8_t prio_select)
{
  uint32_t priority;

