apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_dma.c
  switch (prio_select)
    {
      case DMA_PRIO_LOW_SELECT:
        priority = DMA_PRIORITY_LOW;
        break;

      default:
      case DMA_PRIO_MEDIUM_SELECT:
        priority = DMA_PRIORITY_MEDIUM;
        break;

      case DMA_PRIO_HIGH_SELECT:
        priority = DMA_PRIORITY_HIGH;
        break;

      case DMA_PRIO_ULTRA_HIGHSELECT:
        priority = DMA_PRIORITY_ULTRA_HIGH;
        break;
    }

  return priority;
}

/****************************************************************************
 * Name: gd32_channel_enable
 *
 * Description:
 *   Enable the DMA channelx
 *
 ****************************************************************************/

static void gd32_channel_enable(uint8_t channelx)
{
  uint32_t regaddr;
  uint32_t regval;

  DEBUGASSERT(channelx < DMA_NCHANNELS);

  regaddr = GD32_DMA_CHCTL(channelx);

  regval  = getreg32(regaddr);
  regval |= DMA_CHXCTL_CHEN;

  putreg32(regval, regaddr);
}

/****************************************************************************
 * Name: gd32_channel_disable
 *
 * Description:
 *   Disable the DMA channelx
 *
 ****************************************************************************/

static void gd32_channel_disable(uint8_t channelx)
{
  uint32_t regaddr;
  uint32_t regval;

  DEBUGASSERT(channelx < DMA_NCHANNELS);

  regaddr = GD32_DMA_CHCTL(channelx);

  regval  = getreg32(regaddr);
  regval &= ~DMA_CHXCTL_CHEN;

  putreg32(regval, regaddr);
}

/****************************************************************************
 * Name: gd32_channel_interrupt_enable
 *
 * Description:
 *   Enable the DMA channelx interrupts
 *
 ****************************************************************************/

static void gd32_channel_interrupt_enable(uint8_t channelx,
                                          uint32_t interrupt)
{
  uint32_t regaddr;
  uint32_t regval;

  DEBUGASSERT(channelx < DMA_NCHANNELS);

  regaddr = GD32_DMA_CHCTL(channelx);

  /* Disable all the interrupts at the DMA controller */

  regval  = getreg32(regaddr);
  regval &= ~DMA_INT_MASK;

  /* Set the requested DMA channelx interrupts */

  regval |= (interrupt & DMA_INT_MASK);

  putreg32(regval, regaddr);
}

/****************************************************************************
 * Name: gd32_channel_interrupt_disable
 *
 * Description:
 *   Disable all the DMA channelx interrupts and clear the pending flags
 *
 ****************************************************************************/

static void gd32_channel_interrupt_disable(uint8_t channelx)
{
  uint32_t regaddr;
  uint32_t regval;

  DEBUGASSERT(channelx < DMA_NCHANNELS);

  /* Disable all the interrupts of the channel control register */

  regaddr = GD32_DMA_CHCTL(channelx);

  regval  = getreg32(regaddr);
  regval &= ~DMA_INT_MASK;

  putreg32(regval, regaddr);

  /* Disable the FIFO error interrupt.  Note that, unlike the other channel
   * interrupts, it is enabled in the channel FIFO control register.
   */

  regaddr = GD32_DMA_CHFCTL(channelx);

  regval  = getreg32(regaddr);
  regval &= ~DMA_CHXFCTL_FEEIE;

  putreg32(regval, regaddr);

  /* Clear all the channelx interrupt flags */

  gd32_dma_interrupt_flag_clear(channelx, DMA_INTF_MASK);
}

/****************************************************************************
 * Name: gd32_dma_interrupt_flag_get
 *
 * Description:
 *   Get the DMA channelx interrupt flags
 *
 ****************************************************************************/

static uint8_t gd32_dma_interrupt_flag_get(uint8_t channelx)
{
  uint32_t regaddr;
  uint32_t regval;

  DEBUGASSERT(channelx < DMA_NCHANNELS);

  /* The flags of the channels 0-3 are held in the INTF0 register and the
   * flags of the channels 4-7 in the INTF1 register.
   */

  if (channelx < DMA_INTF_NCHANNELS)
    {
      regaddr = GD32_DMA_INTF0;
    }
  else
    {
      regaddr   = GD32_DMA_INTF1;
      channelx -= DMA_INTF_NCHANNELS;
    }

  regval = getreg32(regaddr) >> ((channelx * 6) + ((channelx >> 1) & 1) * 4);

  return (uint8_t)(regval & DMA_INTF_MASK);
}

/****************************************************************************
 * Name: gd32_dma_interrupt_flag_clear
 *
 * Description:
 *   Clear the DMA channelx interrupt flags
 *
 ****************************************************************************/

static void gd32_dma_interrupt_flag_clear(uint8_t channelx, uint8_t flag)
{
  uint32_t regaddr;

  DEBUGASSERT(channelx < DMA_NCHANNELS);

  if (flag == 0)
    {
      return;
    }

  /* The flags of the channels 0-3 are cleared in the INTC0 register and the
   * flags of the channels 4-7 in the INTC1 register.
   */

  if (channelx < DMA_INTF_NCHANNELS)
    {
      regaddr = GD32_DMA_INTC0;
    }
  else
    {
      regaddr   = GD32_DMA_INTC1;
      channelx -= DMA_INTF_NCHANNELS;
    }

  putreg32(GD32_DMA_FLAG_ADD(flag & DMA_INTF_MASK, channelx), regaddr);
}

/****************************************************************************
 * Name: gd32_dma_interrupt
 *
 * Description:
 *   DMA channel interrupt handler
 *
 ****************************************************************************/

static int gd32_dma_interrupt(int irq, void *context, void *arg)
{
  struct gd32_dma_channel_s *dmachan;
  uint8_t status;

  /* 'arg' should be the DMA channel instance */

  dmachan = (struct gd32_dma_channel_s *)arg;

  DEBUGASSERT(dmachan != NULL);
  DEBUGASSERT(dmachan == &g_dmachan[dmachan->chan_num]);

  /* Get the interrupt status of this channel */

  status = gd32_dma_interrupt_flag_get(dmachan->chan_num);

  if (status != 0)
    {
      gd32_dma_interrupt_flag_clear(dmachan->chan_num, status);

      /* Invoke the DMA callback */

      if (dmachan->callback != NULL)
        {
          dmachan->callback(dmachan, (uint16_t)status, dmachan->arg);
        }
    }

  return OK;
}

/****************************************************************************
 * Name: gd32_dma_singlemode_setup
 *
 * Description:
 *   Configure the DMA channel in single data mode
 *
 ****************************************************************************/

static void gd32_dma_singlemode_setup(struct gd32_dma_channel_s *dmachan,
                                      struct gd32_dma_config_s *cfg)
{
  uint32_t regaddr;
  uint32_t regval;
  uint32_t width;

  dmainfo("periph address: %08" PRIx32 " memory address: %08" PRIx32
          " transfer number: %" PRIu16 "\n",
          cfg->periph_addr, cfg->memory0_addr, cfg->number);

  /* Select the single data mode, i.e. disable the multi data mode */

  regaddr = GD32_DMA_CHFCTL(dmachan->chan_num);

  regval  = getreg32(regaddr);
  regval &= ~DMA_CHXFCTL_MDMEN;

  putreg32(regval, regaddr);

  /* Configure the peripheral base address */

  putreg32(cfg->periph_addr, GD32_DMA_CHPADDR(dmachan->chan_num));

  /* Configure the memory 0 base address */

