apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_dma.c
  putreg32(cfg->memory0_addr, GD32_DMA_CHM0ADDR(dmachan->chan_num));

  /* Configure the number of data to be transferred */

  putreg32(cfg->number, GD32_DMA_CHCNT(dmachan->chan_num));

  /* Configure the transfer mode, the transfer width of the peripheral and
   * of the memory and the channel priority.  In single data mode the
   * peripheral and the memory transfer widths must be the same.
   */

  regaddr = GD32_DMA_CHCTL(dmachan->chan_num);
  regval  = getreg32(regaddr);

  regval &= ~(DMA_CHXCTL_PWIDTH_MASK | DMA_CHXCTL_MWIDTH_MASK |
              DMA_CHXCTL_PRIO_MASK | DMA_CHXCTL_TM_MASK);

  regval |= ((uint32_t)cfg->direction & DMA_CHXCTL_TM_MASK);

  width   = gd32_dma_width_get(cfg->periph_memory_width);
  regval |= DMA_CHXCTL_PWIDTH(width) | DMA_CHXCTL_MWIDTH(width);

  regval |= gd32_dma_priority_get(cfg->priority);

  putreg32(regval, regaddr);
}

/****************************************************************************
 * Name: gd32_dma_multimode_setup
 *
 * Description:
 *   Configure the DMA channel in multi data mode
 *
 ****************************************************************************/

static void gd32_dma_multimode_setup(struct gd32_dma_channel_s *dmachan,
                                     struct gd32_dma_config_s *cfg)
{
  uint32_t regaddr;
  uint32_t regval;

  dmainfo("periph address: %08" PRIx32 " memory address: %08" PRIx32
          " transfer number: %" PRIu16 "\n",
          cfg->periph_addr, cfg->memory0_addr, cfg->number);

  /* Select the multi data mode and configure the FIFO critical value */

  regaddr = GD32_DMA_CHFCTL(dmachan->chan_num);

  regval  = getreg32(regaddr);
  regval &= ~DMA_CHXFCTL_FCCV_MASK;
  regval |= DMA_CHXFCTL_MDMEN | (cfg->fifo_critical &
                                 DMA_CHXFCTL_FCCV_MASK);

  putreg32(regval, regaddr);

  /* Configure the peripheral base address */

  putreg32(cfg->periph_addr, GD32_DMA_CHPADDR(dmachan->chan_num));

  /* Configure the memory 0 base address */

  putreg32(cfg->memory0_addr, GD32_DMA_CHM0ADDR(dmachan->chan_num));

  /* Configure the number of data to be transferred */

  putreg32(cfg->number, GD32_DMA_CHCNT(dmachan->chan_num));

  /* Configure the transfer mode, the transfer width and the burst type of
   * the peripheral and of the memory and the channel priority
   */

  regaddr = GD32_DMA_CHCTL(dmachan->chan_num);
  regval  = getreg32(regaddr);

  regval &= ~(DMA_CHXCTL_PWIDTH_MASK | DMA_CHXCTL_MWIDTH_MASK |
              DMA_CHXCTL_PRIO_MASK | DMA_CHXCTL_TM_MASK |
              DMA_CHXCTL_PBURST_MASK | DMA_CHXCTL_MBURST_MASK);

  regval |= ((uint32_t)cfg->direction & DMA_CHXCTL_TM_MASK);

  regval |= DMA_CHXCTL_PWIDTH(gd32_dma_width_get(cfg->periph_width));
  regval |= DMA_CHXCTL_MWIDTH(gd32_dma_width_get(cfg->memory_width));

  regval |= (cfg->periph_burst & DMA_CHXCTL_PBURST_MASK);
  regval |= (cfg->memory_burst & DMA_CHXCTL_MBURST_MASK);

  regval |= gd32_dma_priority_get(cfg->priority);

  putreg32(regval, regaddr);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: riscv_dma_initialize
 *
 * Description:
 *   Initialize the DMA subsystem
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void weak_function riscv_dma_initialize(void)
{
  struct gd32_dma_channel_s *dmachan;
  uint8_t channelx;

  dmainfo("Initialize DMA\n");

  /* Enable the DMA clock before touching any DMA register */

  gd32_dma_clock_enable();

  /* Initialize each DMA channel */

  for (channelx = 0; channelx < DMA_NCHANNELS; channelx++)
    {
      dmachan = &g_dmachan[channelx];

      /* Attach the DMA channel interrupt vector */

      irq_attach(dmachan->irq, gd32_dma_interrupt, dmachan);

      /* Disable the DMA channel and the channel interrupts */

      gd32_channel_interrupt_disable(dmachan->chan_num);
      gd32_channel_disable(dmachan->chan_num);

      /* Enable the channel interrupt at the ECLIC.  The interrupts are
       * still disabled at the DMA controller.
       */

      up_enable_irq(dmachan->irq);
    }
}

/****************************************************************************
 * Name: gd32_dma_channel_alloc
 *
 * Description:
 *   Allocate a DMA channel.  This function gives the caller mutually
 *   exclusive access to the DMA channel specified by the 'periph_req'
 *   argument.  Should note that a DMA channel only can be used by one
 *   peripheral at the time.
 *
 *   If the DMA channel is not available, then gd32_dma_channel_alloc() will
 *   wait until the holder of the channel relinquishes the channel by calling
 *   gd32_dma_channel_free().
 *
 * Input Parameters:
 *   periph_req - Identifies the DMA channel is request by which peripheral
 *
 * Returned Value:
 *   If periph_req is valid, this function ALWAYS returns a non-NULL
 *   void* DMA channel handle.
 *
 ****************************************************************************/

DMA_HANDLE gd32_dma_channel_alloc(uint8_t periph_req)
{
  struct gd32_dma_channel_s *dmachan;
  uint8_t subperiph;
  uint8_t index;
  int ret;

  /* Get the sub-peripheral number from the peripheral request */

  subperiph = (periph_req >> PERIPH_SHIFT) & PERIPH_MASK;

  DEBUGASSERT(subperiph < DMA_NPERIPHS);

  /* Get the channel number from the peripheral request */

  index = (periph_req >> CHANNEL_SHIFT) & CHANNEL_MASK;

  DEBUGASSERT(index < DMA_NCHANNELS);

  dmachan = &g_dmachan[index];

  /* Get exclusive access to the DMA channel */

  ret = nxsem_wait_uninterruptible(&dmachan->chsem);
  if (ret < 0)
    {
      return NULL;
    }

  dmachan->periph = subperiph;

  return (DMA_HANDLE)dmachan;
}

/****************************************************************************
 * Name: gd32_dma_channel_free
 *
 * Description:
 *   Release a DMA channel.  If another thread is waiting for this DMA
 *   channel in a call to gd32_dma_channel_alloc, then this function will
 *   re-assign the DMA channel to that thread and wake it up.
 *   NOTE:  The 'handle' used in this argument must NEVER be used again
 *   until gd32_dma_channel_alloc() is called again to re-gain access to
 *   the channel.
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   - The caller holds the DMA channel.
 *   - There is no DMA in progress
 *
 ****************************************************************************/

