apache/nuttx/arch/risc-v/src/gd32vw55x/gd32vw55x_dma.c
void gd32_dma_channel_free(DMA_HANDLE handle)
{
  struct gd32_dma_channel_s *dmachan = (struct gd32_dma_channel_s *)handle;

  DEBUGASSERT(dmachan != NULL);
  DEBUGASSERT(dmachan->chan_num < DMA_NCHANNELS);

  /* Disable the DMA channel and the channel interrupts */

  gd32_channel_interrupt_disable(dmachan->chan_num);
  gd32_channel_disable(dmachan->chan_num);

  dmachan->callback = NULL;
  dmachan->arg      = NULL;

  /* Release the channel */

  nxsem_post(&dmachan->chsem);
}

/****************************************************************************
 * Name: gd32_dma_setup
 *
 * Description:
 *   Configure DMA before using
 *
 ****************************************************************************/

void gd32_dma_setup(DMA_HANDLE handle, void *arg, uint8_t data_mode)
{
  struct gd32_dma_channel_s *dmachan = (struct gd32_dma_channel_s *)handle;
  struct gd32_dma_config_s *cfg = (struct gd32_dma_config_s *)arg;
  uint32_t regaddr;
  uint32_t regval;

  DEBUGASSERT(dmachan != NULL && cfg != NULL);
  DEBUGASSERT(dmachan->chan_num < DMA_NCHANNELS);

  /* Make sure that the DMA clock is enabled */

  gd32_dma_clock_enable();

  /* Disable the channel before configuring it */

  gd32_channel_disable(dmachan->chan_num);

  /* Clear all the pending channelx interrupt flags */

  gd32_dma_interrupt_flag_clear(dmachan->chan_num, DMA_INTF_MASK);

  /* Configure the data mode dependent settings */

  if (data_mode == GD32_DMA_MULTI_DATA_MODE)
    {
      gd32_dma_multimode_setup(dmachan, cfg);
    }
  else
    {
      gd32_dma_singlemode_setup(dmachan, cfg);
    }

  /* Configure the address generation algorithm of the peripheral and of the
   * memory, the circular mode and the sub-peripheral selection
   */

  regaddr = GD32_DMA_CHCTL(dmachan->chan_num);
  regval  = getreg32(regaddr);

  if (cfg->periph_inc == DMA_PERIPH_INCREASE_ENABLE)
    {
      regval |= DMA_CHXCTL_PNAGA;
      regval &= ~DMA_CHXCTL_PAIF;
    }
  else if (cfg->periph_inc == DMA_PERIPH_INCREASE_DISABLE)
    {
      regval &= ~(DMA_CHXCTL_PNAGA | DMA_CHXCTL_PAIF);
    }
  else
    {
      regval |= (DMA_CHXCTL_PNAGA | DMA_CHXCTL_PAIF);
    }

  if (cfg->memory_inc == DMA_MEMORY_INCREASE_ENABLE)
    {
      regval |= DMA_CHXCTL_MNAGA;
    }
  else
    {
      regval &= ~DMA_CHXCTL_MNAGA;
    }

  if (cfg->circular_mode == DMA_CIRCULAR_MODE_ENABLE)
    {
      regval |= DMA_CHXCTL_CMEN;
    }
  else
    {
      regval &= ~DMA_CHXCTL_CMEN;
    }

  /* The DMA is always the flow controller */

  regval &= ~DMA_CHXCTL_TFCS;

  /* Select the sub-peripheral of the DMA channel */

  regval &= ~DMA_CHXCTL_PERIEN_MASK;
  regval |= DMA_CHXCTL_PERIEN(dmachan->periph);

  putreg32(regval, regaddr);
}

/****************************************************************************
 * Name: gd32_dma_start
 *
 * Description:
 *   Start the DMA transfer
 *
 * Assumptions:
 *   - DMA handle allocated by gd32_dma_channel_alloc()
 *   - No DMA in progress
 *
 ****************************************************************************/

void gd32_dma_start(DMA_HANDLE handle, dma_callback_t callback, void *arg,
                    uint32_t interrupt)
{
  struct gd32_dma_channel_s *dmachan = (struct gd32_dma_channel_s *)handle;
  uint32_t regval;

  DEBUGASSERT(dmachan != NULL);
  DEBUGASSERT(dmachan->chan_num < DMA_NCHANNELS);

  /* Save the callback info.  It will be invoked when the DMA completes */

  dmachan->callback = callback;
  dmachan->arg      = arg;

  regval = interrupt & DMA_INT_MASK;
  if (regval == 0)
    {
      /* If no interrupt is selected, then enable the full transfer finish
       * interrupt as default
       */

      regval = DMA_CHXCTL_FTFIE;
    }

  /* Enable the channel interrupts and the DMA channel */

  gd32_channel_interrupt_enable(dmachan->chan_num, regval);

  gd32_channel_enable(dmachan->chan_num);
}

/****************************************************************************
 * Name: gd32_dma_stop
 *
 * Description:
 *   Cancel the DMA.  After gd32_dma_stop() is called, the DMA channel is
 *   reset and gd32_dma_setup() must be called before gd32_dma_start()
 *   can be called again
 *
 * Assumptions:
 *   - DMA handle allocated by gd32_dma_channel_alloc()
 *
 ****************************************************************************/

void gd32_dma_stop(DMA_HANDLE handle)
{
  struct gd32_dma_channel_s *dmachan = (struct gd32_dma_channel_s *)handle;

  DEBUGASSERT(dmachan != NULL);
  DEBUGASSERT(dmachan->chan_num < DMA_NCHANNELS);

  gd32_channel_interrupt_disable(dmachan->chan_num);
  gd32_channel_disable(dmachan->chan_num);
}

/****************************************************************************
 * Name: gd32_dma_tansnum_get
 *
 * Description:
 *   Get the number of remaining data to be transferred by the DMA
 *
 * Assumptions:
 *   - DMA handle allocated by gd32_dma_channel_alloc()
 *
 ****************************************************************************/

size_t gd32_dma_tansnum_get(DMA_HANDLE handle)
{
  struct gd32_dma_channel_s *dmachan = (struct gd32_dma_channel_s *)handle;
  uint32_t remain_num;

  DEBUGASSERT(dmachan != NULL);
  DEBUGASSERT(dmachan->chan_num < DMA_NCHANNELS);

  remain_num = getreg32(GD32_DMA_CHCNT(dmachan->chan_num));

  return (size_t)(remain_num & DMA_CHXCNT_CNT_MASK);
}

/****************************************************************************
 * Name: gd32_dma_sample
 *
 * Description:
 *   Sample DMA register contents
 *
 * Assumptions:
 *   - DMA handle allocated by gd32_dma_channel_alloc()
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_DMA_INFO
void gd32_dma_sample(DMA_HANDLE handle, struct gd32_dmaregs_s *regs)
{
  struct gd32_dma_channel_s *dmachan = (struct gd32_dma_channel_s *)handle;
  irqstate_t flags;

  DEBUGASSERT(dmachan != NULL);
  DEBUGASSERT(dmachan->chan_num < DMA_NCHANNELS);

  flags = enter_critical_section();

  regs->intf0    = getreg32(GD32_DMA_INTF0);
  regs->intf1    = getreg32(GD32_DMA_INTF1);
  regs->chctl    = getreg32(GD32_DMA_CHCTL(dmachan->chan_num));
  regs->chcnt    = getreg32(GD32_DMA_CHCNT(dmachan->chan_num));
  regs->chpaddr  = getreg32(GD32_DMA_CHPADDR(dmachan->chan_num));
  regs->chm0addr = getreg32(GD32_DMA_CHM0ADDR(dmachan->chan_num));
  regs->chm1addr = getreg32(GD32_DMA_CHM1ADDR(dmachan->chan_num));
  regs->chfctl   = getreg32(GD32_DMA_CHFCTL(dmachan->chan_num));

  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: gd32_dma_dump
 *
 * Description:
 *   Dump previously sampled DMA register contents
 *
 * Assumptions:
 *   - DMA handle allocated by gd32_dma_channel_alloc()
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_DMA_INFO
void gd32_dma_dump(DMA_HANDLE handle, const struct gd32_dmaregs_s *regs,
                   const char *msg)
{
  struct gd32_dma_channel_s *dmachan = (struct gd32_dma_channel_s *)handle;

  DEBUGASSERT(dmachan != NULL);

  dmainfo("DMA channel %u registers: %s\n", dmachan->chan_num, msg);
  dmainfo("     INTF0: %08" PRIx32 "\n", regs->intf0);
  dmainfo("     INTF1: %08" PRIx32 "\n", regs->intf1);
  dmainfo("     CHCTL: %08" PRIx32 "\n", regs->chctl);
  dmainfo("     CHCNT: %08" PRIx32 "\n", regs->chcnt);
  dmainfo("   CHPADDR: %08" PRIx32 "\n", regs->chpaddr);
  dmainfo("  CHM0ADDR: %08" PRIx32 "\n", regs->chm0addr);
  dmainfo("  CHM1ADDR: %08" PRIx32 "\n", regs->chm1addr);
  dmainfo("    CHFCTL: %08" PRIx32 "\n", regs->chfctl);
}
#endif

#endif /* CONFIG_GD32VW55X_DMA */
